Ran Plan for dir: `service_deployment/core-payment` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # module.deployment.data.template_file.container_definitions will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "container_definitions"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            [
              {
                "name" : "${unit}-${env}-${code}-${feature}-php",
                "image" : "${image}:latest",
                "cpu" : ${cpu},
                "memory" : ${memory},
                "memoryReservation" : ${memory_reservation},
                "essential" : true,
                "mountPoints"  : [],
                "volumesFrom"  : [],
                "portMappings" : [
                  {
                    "containerPort" : ${port},
                    "hostPort" : ${port},
                    "protocol"  : "tcp"
                  }
                ],
                "logConfiguration": {
                  "logDriver": "awslogs",
                  "secretOptions": null,
                  "options": {
                    "awslogs-group": "/service/${code}/${feature}",
                    "awslogs-region": "ap-southeast-2",
                    "awslogs-stream-prefix": "ecs"
                  }
                }
              }
            ]
        EOT
      + vars     = {
          + "code"               = "core"
          + "cpu"                = "128"
          + "env"                = "dev"
          + "feature"            = "payment"
          + "image"              = (known after apply)
          + "memory"             = "512"
          + "memory_reservation" = "128"
          + "port"               = "80"
          + "unit"               = "avn"
        }
    }

  # module.deployment.aws_appautoscaling_policy.autoscaling_policy[0] will be created
+ resource "aws_appautoscaling_policy" "autoscaling_policy" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "avn-dev-core-payment-autoscaling"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/avn-dev-compute-ecs-cluster/avn-dev-core-payment"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 15
          + scale_out_cooldown = 5
          + target_value       = 175

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.deployment.aws_appautoscaling_target.autscaling_target will be created
+ resource "aws_appautoscaling_target" "autscaling_target" {
      + id                 = (known after apply)
      + max_capacity       = 8
      + min_capacity       = 2
      + resource_id        = "service/avn-dev-compute-ecs-cluster/avn-dev-core-payment"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # module.deployment.aws_cloudwatch_log_group.log_group will be created
+ resource "aws_cloudwatch_log_group" "log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/service/core/payment"
      + retention_in_days = 30
      + tags_all          = (known after apply)
    }

  # module.deployment.aws_codebuild_project.build_project will be created
+ resource "aws_codebuild_project" "build_project" {
      + arn            = (known after apply)
      + badge_enabled  = false
      + badge_url      = (known after apply)
      + build_timeout  = 60
      + description    = (known after apply)
      + encryption_key = (known after apply)
      + id             = (known after apply)
      + name           = "avn-dev-core-payment"
      + queued_timeout = 480
      + service_role   = (known after apply)
      + tags_all       = (known after apply)

      + artifacts {
          + encryption_disabled    = false
          + override_artifact_name = false
          + type                   = "CODEPIPELINE"
        }

      + cache {
          + modes = [
              + "LOCAL_CUSTOM_CACHE",
              + "LOCAL_DOCKER_LAYER_CACHE",
              + "LOCAL_SOURCE_CACHE",
            ]
          + type  = "LOCAL"
        }

      + environment {
          + compute_type                = "BUILD_GENERAL1_SMALL"
          + image                       = "aws/codebuild/amazonlinux2-x86_64-standard:3.0"
          + image_pull_credentials_type = "CODEBUILD"
          + privileged_mode             = true
          + type                        = "LINUX_CONTAINER"

          + environment_variable {
              + name  = "STAGE"
              + type  = "PLAINTEXT"
              + value = "BUILD"
            }
          + environment_variable {
              + name  = "AWS_DEFAULT_REGION"
              + type  = "PLAINTEXT"
              + value = "ap-southeast-2"
            }
          + environment_variable {
              + name  = "SERVICE_NAME"
              + type  = "PLAINTEXT"
              + value = "avn-dev-core-payment"
            }
          + environment_variable {
              + name  = "REPOSITORY_URI_PHP_FPM"
              + type  = "PLAINTEXT"
              + value = (known after apply)
            }
          + environment_variable {
              + name  = "REPOSITORY_URI_NGINX"
              + type  = "PLAINTEXT"
              + value = (known after apply)
            }
          + environment_variable {
              + name  = "IMAGE_NAME_PHP_FPM"
              + type  = "PLAINTEXT"
              + value = "avn-dev-core-payment-php"
            }
          + environment_variable {
              + name  = "IMAGE_NAME_NGINX"
              + type  = "PLAINTEXT"
              + value = "avn-dev-core-payment-nginx"
            }
        }

      + source {
          + buildspec = "buildspec.yml"
          + type      = "CODEPIPELINE"
        }

      + vpc_config {
          + security_group_ids = (known after apply)
          + subnets            = [
              + "subnet-00f89800fa4237202",
              + "subnet-0511c6d48f039c9ae",
            ]
          + vpc_id             = "vpc-09c385a786b8dc2c4"
        }
    }

  # module.deployment.aws_codepipeline.codepipeline will be created
+ resource "aws_codepipeline" "codepipeline" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "avn-dev-core-payment"
      + role_arn = (known after apply)
      + tags_all = (known after apply)

      + artifact_store {
          + location = "avn-dev-storage-s3-pipeline"
          + region   = (known after apply)
          + type     = "S3"
        }

      + stage {
          + name = "Source"

          + action {
              + category         = "Source"
              + configuration    = {
                  + "Branch"               = "main"
                  + "OAuthToken"           = (sensitive)
                  + "Owner"                = (sensitive)
                  + "PollForSourceChanges" = "false"
                  + "Repo"                 = "avn-core-payment"
                }
              + name             = "Source"
              + output_artifacts = [
                  + "Source",
                ]
              + owner            = "ThirdParty"
              + provider         = "GitHub"
              + region           = (known after apply)
              + run_order        = (known after apply)
              + version          = "1"
            }
        }
      + stage {
          + name = "Build"

          + action {
              + category         = "Build"
              + configuration    = {
                  + "ProjectName" = "avn-dev-core-payment"
                }
              + input_artifacts  = [
                  + "Source",
                ]
              + name             = "Build"
              + output_artifacts = [
                  + "BuildArtifact",
                ]
              + owner            = "AWS"
              + provider         = "CodeBuild"
              + region           = (known after apply)
              + run_order        = (known after apply)
              + version          = "1"
            }
        }
      + stage {
          + name = "Deploy"

          + action {
              + category        = "Deploy"
              + configuration   = {
                  + "ClusterName" = "arn:aws:ecs:ap-southeast-2:714071859213:cluster/avn-dev-compute-ecs-cluster"
                  + "FileName"    = "avn-dev-core-payment.json"
                  + "ServiceName" = "avn-dev-core-payment"
                }
              + input_artifacts = [
                  + "BuildArtifact",
                ]
              + name            = "Deploy"
              + owner           = "AWS"
              + provider        = "ECS"
              + region          = (known after apply)
              + run_order       = (known after apply)
              + version         = "1"
            }
        }
    }

  # module.deployment.aws_codepipeline_webhook.codepipeline_webhook will be created
+ resource "aws_codepipeline_webhook" "codepipeline_webhook" {
      + authentication  = "GITHUB_HMAC"
      + id              = (known after apply)
      + name            = "webhook-codepipeline-avn-dev-core-payment"
      + tags_all        = (known after apply)
      + target_action   = "Source"
      + target_pipeline = "avn-dev-core-payment"
      + url             = (known after apply)

      + authentication_configuration {
          + secret_token = (sensitive value)
        }

      + filter {
          + json_path    = "$.ref"
          + match_equals = "refs/heads/main"
        }
    }

  # module.deployment.aws_ecr_lifecycle_policy.ecr_policy_nginx will be created
+ resource "aws_ecr_lifecycle_policy" "ecr_policy_nginx" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Remove image more than 10"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "avn-dev-core-payment-nginx"
    }

  # module.deployment.aws_ecr_lifecycle_policy.ecr_policy_php will be created
+ resource "aws_ecr_lifecycle_policy" "ecr_policy_php" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Remove image more than 10"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "avn-dev-core-payment-php"
    }

  # module.deployment.aws_ecr_repository.ecr_nginx will be created
+ resource "aws_ecr_repository" "ecr_nginx" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "avn-dev-core-payment-nginx"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.deployment.aws_ecr_repository.ecr_php will be created
+ resource "aws_ecr_repository" "ecr_php" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "avn-dev-core-payment-php"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.deployment.aws_ecs_service.ecs_service will be created
+ resource "aws_ecs_service" "ecs_service" {
      + cluster                            = "arn:aws:ecs:ap-southeast-2:714071859213:cluster/avn-dev-compute-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "avn-dev-core-payment"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "avn-dev-core-payment-php"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-00f89800fa4237202",
              + "subnet-0511c6d48f039c9ae",
            ]
        }
    }

  # module.deployment.aws_ecs_task_definition.task_definition will be created
+ resource "aws_ecs_task_definition" "task_definition" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "avn-dev-core-payment"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # module.deployment.aws_iam_role.codebuild_role will be created
+ resource "aws_iam_role" "codebuild_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codebuild.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "avn-dev-core-payment-codebuild-role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.deployment.aws_iam_role.codepipeline_role will be created
+ resource "aws_iam_role" "codepipeline_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codepipeline.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "avn-dev-core-payment-codepipeline-role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.deployment.aws_iam_role.task_execution_role will be created
+ resource "aws_iam_role" "task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "avn-dev-core-payment-task-execution-role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.deployment.aws_iam_role.task_role will be created
+ resource "aws_iam_role" "task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "avn-dev-core-payment-task-role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.deployment.aws_iam_role_policy.task_execution_policy will be created
+ resource "aws_iam_role_policy" "task_execution_policy" {
      + id     = (known after apply)
      + name   = "avn-dev-core-payment-task-exeuction-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "ssm:Describe*",
                          + "ssm:Get*",
                          + "ssm:List*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.deployment.aws_iam_role_policy.task_policy will be created
+ resource "aws_iam_role_policy" "task_policy" {
      + id     = (known after apply)
      + name   = "avn-dev-core-payment-policy-name"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObjectAcl",
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                      + Sid      = "Stmt1630978762833"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.deployment.aws_iam_role_policy_attachment.codebuild_attach_policy will be created
+ resource "aws_iam_role_policy_attachment" "codebuild_attach_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "avn-dev-core-payment-codebuild-role"
    }

  # module.deployment.aws_iam_role_policy_attachment.codepipeline_attach_policy will be created
+ resource "aws_iam_role_policy_attachment" "codepipeline_attach_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "avn-dev-core-payment-codepipeline-role"
    }

  # module.deployment.aws_lb_listener.nlb_http_listener will be created
+ resource "aws_lb_listener" "nlb_http_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:ap-southeast-2:714071859213:loadbalancer/net/avn-dev-compute-ecs-nlb/e71b6466f0f517b8"
      + port              = 80
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.deployment.aws_lb_target_group.nlb_tg will be created
+ resource "aws_lb_target_group" "nlb_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 30
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "avn-dev-core-payment-tg"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "TCP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Code"    = "core"
          + "Env"     = "dev"
          + "Feature" = "payment-tg"
          + "Name"    = "avn-dev-core-payment-tg"
        }
      + tags_all                           = {
          + "Code"    = "core"
          + "Env"     = "dev"
          + "Feature" = "payment-tg"
          + "Name"    = "avn-dev-core-payment-tg"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-09c385a786b8dc2c4"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 30
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = "traffic-port"
          + protocol            = "TCP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 5
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.deployment.aws_secretsmanager_secret.secret will be created
+ resource "aws_secretsmanager_secret" "secret" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = "arn:aws:kms:ap-southeast-2:714071859213:alias/avn-dev-security-kms"
      + name                           = "avn-dev-core-payment"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # module.deployment.aws_secretsmanager_secret_version.secret_version will be created
+ resource "aws_secretsmanager_secret_version" "secret_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.deployment.aws_security_group.sg will be created
+ resource "aws_security_group" "sg" {
      + arn                    = (known after apply)
      + description            = "Security Group for avn-dev-core-payment service"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "avn-dev-core-payment-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Code"    = "core"
          + "Env"     = "dev"
          + "Feature" = "payment"
          + "Name"    = "avn-dev-core-payment-sg"
        }
      + tags_all               = {
          + "Code"    = "core"
          + "Env"     = "dev"
          + "Feature" = "payment"
          + "Name"    = "avn-dev-core-payment-sg"
        }
      + vpc_id                 = "vpc-09c385a786b8dc2c4"
    }

  # module.deployment.aws_security_group_rule.sg_eg_all will be created
+ resource "aws_security_group_rule" "sg_eg_all" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow egress all protocol avn-dev-core-payment service"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.deployment.aws_security_group_rule.sg_in_tcp will be created
+ resource "aws_security_group_rule" "sg_in_tcp" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow ingress http for avn-dev-core-payment service"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.deployment.aws_ssm_parameter.role_arn will be created
+ resource "aws_ssm_parameter" "role_arn" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = "arn:aws:kms:ap-southeast-2:714071859213:alias/avn-dev-security-kms"
      + name      = "/avn/dev/secret/core/payment/IAM_ROLE_ARN"
      + tags_all  = (known after apply)
      + tier      = "Standard"
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # module.deployment.github_branch.dev[0] will be created
+ resource "github_branch" "dev" {
      + branch        = "dev"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "avn-core-payment"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.deployment.github_repository.repo[0] will be created
+ resource "github_repository" "repo" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Repository for avn-core-payment service"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "avn-core-payment"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
    }

  # module.deployment.github_repository_webhook.github_webhook will be created
+ resource "github_repository_webhook" "github_webhook" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "push",
        ]
      + id         = (known after apply)
      + repository = "avn-core-payment"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = true
          + secret       = (sensitive value)
          + url          = (sensitive value)
        }
    }

Plan: 31 to add, 0 to change, 0 to destroy.

Warning: The CodePipeline GitHub version 1 action provider is deprecated.

  with module.deployment.aws_codepipeline.codepipeline,
  on ../../modules/deployment/codepipeline.tf line 39, in resource "aws_codepipeline" "codepipeline":
  39:       provider         = "GitHub"

Use a GitHub version 2 action (with a CodeStar Connection
`aws_codestarconnections_connection`) instead. See
https://docs.aws.amazon.com/codepipeline/latest/userguide/update-github-action-connections.html

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d service_deployment/core-payment`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.blast.co.id/lock?id=greyhats13%252Favana-aws-infra%252Fservice_deployment%252Fcore-payment%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d service_deployment/core-payment`
</details>
Plan: 31 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
